import warnings
warnings.filterwarnings("ignore", category=DeprecationWarning)


if __name__ == '__main__':
    print("\033[31m红色文字\033[0m")
    print("\033[42m绿色背景\033[0m")
    print("\033[1m加粗文字\033[0m")
    print("\033[4m下划线文字\033[0m")
    print("\033[31;42m红色文字绿色背景\033[0m")


# 前景色（文字颜色）：
# \033[30m：黑色
# \033[31m：红色
# \033[32m：绿色
# \033[33m：黄色
# \033[34m：蓝色
# \033[35m：洋红色
# \033[36m：青色
# \033[37m：白色
# 背景色：
# \033[40m：黑色
# \033[41m：红色
# \033[42m：绿色
# \033[43m：黄色
# \033[44m：蓝色
# \033[45m：洋红色
# \033[46m：青色
# \033[47m：白色
# 特效：
# \033[1m：加粗
# \033[4m：下划线
# \033[7m：反转颜色（前景色和背景色交换）
